Revit 2022 API
TriangulatedShellComponent Methods
The TriangulatedShellComponent type exposes the following members.
Methods
Name | Description
Clear
 Empties the contents of this TriangulatedShellComponent.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetTriangle
 Returns the triangle corresponding to the given index.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetVertex
 Returns the vertex with a given index.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
TriangulatedShellComponent Class
Autodesk.Revit.DB Namespace